{"podcast_details": {"podcast_title": "How to Trade Stocks and Options Podcast by 10minutestocktrader.com", "episode_title": "📉 S&P 500 Hits March-Low, 🍺 Bud Sales Struggle, 🔍 OpenAI Admits Limits", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/627041/627041-1641306336279-60b555c82b818.jpg", "episode_transcript": " Good morning traders, hope you're having a great day. Thank you for joining us on today's outlier live today. We're going to be covering the top three stories of the day. Number one, the S&P 500 is crashing. What are you going to do about it? Number two, Bud Light has said they're never going to recover. They're never going to financially recover from this. And number three, ChatGPT has just decided and declared that they can't even identify what ChatGPT is doing. So we're going to tune into all three of those stories on today's outlier live. Oh, top story of the day. The S&P 500 closes below the 50 day moving average. That's the lowest since March. I don't know about you, but I definitely am getting my tinfoil hat ready. I definitely am stocking my bunker. I definitely am getting ready for a huge major crash. Maybe. Welcome to the outlier live stream today. If you're just tuning in, my name is Christopher Yule and I love talking about stocks and finding those outlier trades with outsized returns. And if you're interested in that too, be sure to definitely hit the subscribe button down below. And today's episode is sponsored by outlier.com. Go to ovtlyr.com to find out why outliers win. So the S&P 500 just closed below the 50 day moving average. Let's go take a look at the SPY real quick. And yeah, so the red line right here is the exponential moving average, but it is below the simple moving average of the 50 day. And what we want to see is a bounce right here. If the market cannot bounce back up, if the market can't take this level and then turn around and go back up, we may be in for a world to hurt. Right? Let's in fact, let's zoom out just a little bit back. The last time this happened, we all remember the start of 2022 where everything seemed to be going well in 2021. And then, oh no, we lost the 50 day. And that was the first canary in the coal mine to really start a huge decline, right? We lost the 50 day about right here in January. And then a couple of times we retook it, but we never gained the bull market back. And we saw some really impressive declines down from a high of around 480 down to a low of around 348. So about 130 point swing in the SPY. Now could we be looking at that again? I think it's very possible. Look at how strong this trend has been, right? And we've had barely any corrections at all since March, since April. And now looking at the 50 day right now, if it can't hold, I think we could be in for a world to hurt. I mean, we got a sell signal from Outlier all the way back on June 23rd. And you can see the market has really been taking on the chin ever since that time. And here's a couple of pro tips for you here. I got this from one of my mentors, the name Steve Burns. You may have heard of him before. Here is a quick cheat sheet. And if you want to screenshot this so you can keep it forever, I definitely would recommend you do so. It talks about the different moving averages and the fact that we just took out the 50 day as a key support level and a long term uptrend. So that's why I say if we can't bounce from here, if we can't hit that level and go back up, we've lost support in a long term uptrend. So that is absolutely a bearish, definitely bearish sign. April, good morning to you. Brian, good morning. Thank you all for tuning in live. Yeah, so right now the market is not looking healthy. We've got big sell signals out in the Outlier space. And everyone who used to be bullish, yeah, they're getting a lot more bearish. In fact, just scrolling through the comments here, you know, let's see what some people are saying. Interesting turn of events. This person says we're going to make it. And let's see here. Michael Burry was just talking the other day about how he set up his portfolio to be very, very short. And he might have had the timing spot on. So if you're interested in that, if this is exciting to you, if you're a trader and you'd love to see a market go up as well as a market go down, because you know you can make money both ways, be sure to hit the like button. Right. Let your YouTube algorithm know that you like this kind of content and let us know that, hey, you're in the right place. Right. You're watching the right kind of content because this is what we bring for you every single day on Outlier Live. Let's move into our second story. All right. Second story of the day. Bud Light has officially said they are no longer expecting sales to recover from the incident from the marketing campaign with a certain influencer. I don't know about you, but I have not been a fan of Bud Light. I'm a Guinness guy myself. So this doesn't impact me in any way. But I know that clearly there are a lot of people who work in the Bud Light space and they are not very happy about what is happening to their business model. And if you're just tuning in, my name is Christopher Yule and I love talking about stocks and finding those outlier trades with outsized returns. And if you're interested in that too, be sure to definitely hit the subscribe button down below and today's episode is sponsored by Outlier.com. Go to OVTLYR.com to find out why outliers win. That reminds me of the quote from Tiger King. I will never financially be able to recover from this or something along those lines. Yeah. That's basically what Bud Light has said. We screwed up bad. And I think the real issue with Bud Light and everyone's played this out, right? Everybody's had their opinions on this. This has been played out for so long. The real issue here was the fact that they had a core customer base that they had established for a hundred years of, as their former marketing chief described it, fratty, out of touch men who frankly we don't want them anymore. We want younger individuals, which that in its own right is a problem because we can't be advertising alcohol to children clearly. So the fact that they completely shut out their core customer base told them, we don't want your business anymore. We're interested in a different segment. And you know what? If you drink this beer, you kind of fall into that different segment. That's the way to look at it, right? Think of it exactly like a sports deal, right? LeBron James is sponsored by Nike. Nike wants you to buy their clothing, their shoes, their sports equipment, because if you do, hey, you're going to be a lot like LeBron James. Now translate that to the other side of what we're talking about here. Translate that for Bud Light. I'll let you do the mental gymnastics here, but you and I both know that Bud Light's core customers, they don't want that. Bud Light's core customers, they're not interested in that lifestyle. Okay? I'm not going to call anybody, you do you, I don't care. But what I'm saying is from a business perspective, Bud Light really shot themselves in the foot because their customers basically voted with their dollars and said, you done screwed up. You done messed up. We don't want your business anymore. We're going to buy everything else except your product. In fact, we got a sell signal in Outlier back on July 7th in Bud, which is Anheuser-Busch. Now that includes all the Anheuser-Busch products, not just Bud Light. But look at this, right? Bud Light was on a real tear. Look at this. From earlier this year, Bud Light had grown from around $45 hitting a high of around 67. That's like a 50% rise, give or take. And then, oh man, we're not looking sharp at all. In fact, we're looking really, really bearish in this environment right here. So man, I'll tell you what, I don't know what Bud Light was thinking, but I do know that their customers, they let them know exactly how they felt. And the Outlier data proved to definitely showcase what was going on back on July 7th. And let's see what the comments are. There's probably going to be some pretty ugly comments here. Well, actually, you know what? Hope that's going to be a lesson for all corporations wanting those ESG points. Yeah, you can earn all the ESG points you want, but if you don't have a business anymore because you scared away all your customers because they don't want to be like your spokesperson, we've got a huge problem here. So that's definitely a risque topic in today's landscape. Don't cancel me, but do hit that like button down below because we want to make sure that you are getting the timely information to help you make decisions for your portfolio. And that is how Outlier is here to help you out. So smash the like button and let's go to our final story of the day. This is kind of embarrassing. Chat GPT can't even tell if what it's looking at was written by Chat GPT or not. This is actually hilarious to me. OpenAI, the creator of Chat GPT, has admitted it can't even identify AI generated text. Oh, give me a break. But if you're just tuning in, my name is Christopher Yule and I love talking about stocks and finding those Outlier trades with outsized returns. And if you're interested in that too, be sure to definitely hit the subscribe button down below. And if today's episode is sponsored by Outlier.com, go to OVTLYR.com to find out why Outliers win. Chat GPT, give me a break here. Listen, me and my team, we use Chat GPT like nobody's business. But I had heard that if you were submitting articles to places or if you were writing these and sending them to other people that there is a chance that people would like very clearly say, oh, this is written by Chat GPT. Or they would run it through some sort of filter that said, oh yeah, this is definitely written by Chat GPT. In fact, I saw this is so funny. I saw a stat and I didn't pull it up. I should have. I saw a stat that said if you ran the Declaration of Independence through one of these AI detectors, that it would say it was 70% written by Chat GPT or another AI platform. And that was hilarious to me. Right? I can't even tell who is writing and who isn't writing using Chat GPT. So all you college students out there, you're good to go. Just put in your term papers and Chat GPT and they can't, Chat GPT can't even tell what Chat GPT writes anymore. I mean Chat GPT, as much as I love that platform, it definitely has its faults. But I do think that this is an opportunity from an investor perspective to maybe look around, right? Maybe, maybe Microsoft, which I feel like they have a deal with Chat GPT, if I'm not mistaken. Maybe Microsoft could be an interesting opportunity. And taking a look at Microsoft stock, just like everything, it's been pretty beat up lately, but it does have a buy signal back on July 20th. So looking at the outlier data, this could be an opportunity to get in. I know a lot of people that were really upset because Microsoft was one of the stocks that fell the hardest during the bear market of 2022. Look at that. It actually has hit new all time highs, not too long ago. And outlier data definitely shows a buy signal here. So maybe that's something that Chat GPT and OpenAI could look at is using some Microsoft products to help figure out how to run their business just a little bit better. Because right now Chat GPT doesn't even know what Chat GPT is doing, right? It's just off the rails. Let's see what the comments say on this. OpenAI just called out all the fad apps saying they can screen for AI genera- this is what I was talking about. They can screen for AI generated text and clearly it cannot do that if the creator cannot. Yeah, exactly. Of course they can't. And now universities that kick students out for suspected use are about to get hit with some wildly successful lawsuits. Oh man, that sounds like an interesting thing that's going to happen. Yeah. I mean, I had heard those, right? Those stories where people were saying, there was one professor that failed an entire class because he said, everybody's using Chat GPT so I'm going to fail the entire class. Are you kidding me? Do you know how pissed I would be if I gave the university my money and they took that class that I worked all semester on and said, nope, fail. What? No, sir. So yeah, if all of these platforms can't even detect that they are using Chat GPT, even the maker itself can't even detect that she's in Chat GPT, yeah, it's definitely come to a head here. But I do think that in the near future, they could be figuring something out. So don't put all your eggs in one basket, but do put your eggs on the like button basket. Smash that button down below to let the YouTube algorithm know that you like this kind of content and you like the fact that we come here every single day. So be sure to subscribe so that you never miss one of our episodes. Mahesh and I are both taking on this every single day. We're covering the top stories of the week and some fundamental analysis and stock picks that Mahesh is working through. So thank you all so much for coming to today's episode of Outlier Live. We covered the top three stories of the day. We covered how Chat GPT has no idea what it's doing. We covered how Bud Light has definitely said that they will never financially recover from this and our stock's ready to crash, right? Get your helmets on, get ready to go. I think we might be in for a world of hurt if the market cannot find a way to bounce at this point. Thank you all so much for coming to today's Outlier Live. Be sure to subscribe and I will see you back here next time. Mahesh will be here tomorrow talking about his analysis. Talk soon. Pandemic is agins and ends!"}, "podcast_summary": "In this podcast, the host covers three main stories of the day. The first story discusses the S&P 500 closing below the 50-day moving average, which is seen as a bearish sign and could indicate a market crash. The host highlights the importance of the market bouncing back from this level to avoid further decline. The second story discusses Bud Light's admission that they do not expect their sales to recover from a marketing campaign incident with an influencer. The host explains how Bud Light's shift away from their core customer base has led to a decline in their stock price and customer loyalty. The third story discusses Chat GPT, an AI platform, admitting that it cannot even identify its own AI-generated text. The host finds this amusing and suggests that Microsoft, who has a deal with Chat GPT, could be an interesting investment opportunity. Overall, the host provides commentary on these stories and shares Outlier's analysis and signals for potential stock trades.", "podcast_guest": "Christopher Yule", "podcast_highlights": ""}