{"podcast_details": {"podcast_title": "Idea to Startup", "episode_title": "The One Thing That Matters - How to Find a Differentiator That'll Support a Business", "episode_image": "https://image.simplecastcdn.com/images/3b6a989b-4e5b-4b2a-9517-fadf66e63eba/cd6f6370-de60-4ad6-a3b6-5bb9aab28021/3000x3000/7.jpg?aid=rss_feed", "episode_transcript": " I'm Brian Scordato and this is the Idea to Startup Podcast, a podcast that's been called quote, easily 10 times more useful than my MBA, which probably says more about higher education than our pod, but it was a nice review. We're going to start sending the pod along with some deeper content each week, so if you're a power listener of Idea to Startup, head to gettacklebox.beehive.com or the link in the show notes. Beehive is spelled a bit wildly, so it's gettacklebox.beehive.com. On to it. Today, we're going to help you find a differentiator sturdy enough to support a business. If this feels a little daunting, good. It's probably the most important decision you'll make, and since it's so important, entrepreneurs tend to shy away from it. Humans are wired to avoid discomfort, and what is less comfortable than making a decision that's seemingly permanent, the thing you'll lean on to make or break your business? But remember from last week, to be a good entrepreneur, you've got to be a buffalo. Run into the storm. Work to rewire your brain to get excited when you start to get that pit in your stomach. That means you're on to something. The uncomfortable path is the one that leads you to places most other people never go, which is where all the interesting stuff in life tends to be. Stop uncomfortable for opportunity in your mind, and you're going to be alright. So today, we'll do that, to find your differentiator. We're going to start by getting everyone on the same page about what a differentiator is, and more importantly, what it'll help you do. Then we'll talk about bagels. Finally, we'll give you a framework to find your differentiator. Nice little summer episode. And yes, fine. Before we start, let's close the loop. I did watch Interstellar. It was good. I enjoyed it. You all win. I'm not sure it's email someone from a podcast who was really only using it as a literary structural device to yell at them for not liking it good, but I'm not going to tell you how to eat your Cheerios. I did also get some emails about my failure to launch jokes, saying that that is a great movie I shouldn't slander either, but I have to draw the line somewhere, and I'm drawing it here. A movie that got a 23% on Rotten Tomatoes and has reviews like this one from Alberto Abowin that described it as, quote, a very weak film in which very few things are good, is not breaking into the roughly 17 minutes of leisure time I get each day while running a business and trying to get an eight month old to eat smushed up peaches while Ruby pouts in the corner with a you used to be cool man look on her face that shatters my heart. It just isn't in the cards. Anyway, let's talk differentiators. The term itself is broad and surprisingly hard to wrap your arms around, which is coincidentally exactly how one reviewer described failure to launch. Sorry, I'm done. If you're early on in your startup journey and I ask you what your differentiator is, you're probably going to struggle to answer. Your thoughts might go right to product. What are you going to build that will be sufficiently different from your competitors? Maybe it's a feature. Maybe it's a bunch of features that together make you different. Or you might think I'm tricking you and you know that I love customer stuff, so you might move there. Maybe your differentiator is focusing on a customer that competitors can't, don't, or won't focus on for whatever reason. Maybe you think it'll be a servicy differentiator like how Zappos says customer support is theirs. Or maybe it'll be something completely vague like quote, we'll pay attention to the details or quote, we'll work harder than anyone. If you aren't clear on your differentiator, then you don't have one. And I don't blame you because the term differentiator isn't clear. People use it to describe lots of things and without knowing in the parlance of last week's episode that differentiator's job to be done is hard to have one, which means you won't benefit from it. So let's start there. What is the quote job of a differentiator? As a founder, what are you hiring one to do? The answer is that they help you make decisions fast. Differentiators are about speed. Decisions are oxygen for your startup and they're exceedingly hard to make for entrepreneurs. Not because we're indecisive, although a lot of us are. More because we never have enough information to make a truly informed decision and that scenario takes a while to get used to. It's like buying a car only knowing that it quote, has some wheels and might work. There's the emotional component too. Decisions feel weightier when it feels like your self-worth as an entrepreneur is on the line. You're buying that car you know nothing about and you're spending your life savings on it and your friends will judge you based on how it drives. Or at least it feels that way. So a differentiator, one thing that supersedes everything else, is really important because it can act as your organizing principle. It serves as the source of truth amongst all the incomplete information you have. You pick a differentiator, then every decision you make is in support of that thing. This might not make a ton of sense in the abstract, so here's a quick example. Let's say you're starting a jeans brand. When you go to create a landing page in social ads and emails and everything else, you'll hit a decision wall. If in your mind you see yourself as a jeans company that makes organic and stretchy jeans in the USA and every pair you sell, you also donate a pair to a homeless shelter and you're going to grow through small grassroots influencers on TikTok, you're going to be paralyzed. If there's no hierarchy, no organizing principle, you don't know what to include or to leave out. The story gets overwhelming. It'll become an exercise in the attention pie. If you don't remember this mental device from our good friend Joey Cofone, the attention pie is the idea that each new message you create dilutes all the others. The more things you have, the more clutter the pie, the less importance any one thing gets. The harder it is for your customer to know what you do and make a decision about you. But if you have a differentiator, one thing you believe anchors the company, one thing truly different that's going to break through, you can organize around it. So maybe you're making jeans and your differentiator is that you make high end jeans that are custom fit for women under five foot one, because no other jeans company is focusing on that customer. Then your landing page becomes easy. Every bit of it supports that differentiator. Maybe your sizing is different and the pockets are in different shapes and you work with women under five foot one on TikTok and on and on and on. And you can just put those things on the website. But each of the subsequent decisions supports the big one. We make high quality jeans for women under five foot one. It's clear why you exist, who you're for, what your secret is. It's actionable. Think about how much easier it is to make those landing pages and social ads. Every decision waterfalls from that core differentiator. Where should you market? Who should you partner with? What materials should you source? These decisions become fast because you have a purpose for each support the core message. Best of all, since you are so different from your competitors, you can use their strengths against them like some sort of entrepreneurship jujitsu move. They can't possibly compete because while their jeans might be beautiful, the inseam doesn't flatter people under five one and the pockets don't sit like yours. And all the things they're set up to do are actually harmful for building something specific to your customer. A clear differentiator, one your customer cares about, one obviously different from competitive offerings when you keep making decisions to support becomes a moat. Because to copy you, competitors might need to do 10 things as well as you, which just isn't happening. There's a great book by a real jerk called Leading with the Heart. It's written by Coach K, the old Duke basketball coach who was a real cheater. He also lost his last game to UNC for the record. Anyway, the book is grudgingly fantastic. I read it as a sort of keep your enemies closer thing. One of the core themes is that courage plus confidence leads to decision making. Slow decision making comes from either a lack of confidence or a lack of courage. A clear differentiator shifts this equation in your favor and lets you move fast. You're confident in what matters and this makes the courageous part much easier. Plus you're a buffalo. You'll be good. I visualized the structure of a great company like a pyramid with your differentiator, something meaningfully obviously uniquely different sitting at the top. Then a latticework of thousands of decisions are the blocks that support it. Today we'll help you think through this and figure out your differentiator. And we'll start by talking about the best bagel in New York City, which just so happens to come from a shop in the suburbs of Connecticut. We'll sort through that. After I go throw up in the bathroom because I complimented my sworn enemy coach K. Then we listen to some smooth jazz. If you've got a startup idea and a full time job and want to test out the former before you leave the ladder, come and work with us. Apply at gettacklebox.com. Over 400 startups have tested and built ideas through our program and those businesses are now collectively worth over a billion dollars. Our program helps you prioritize and execute and our members and me and the team keep you accountable and give you feedback along the way. Come build with us at gettacklebox.com. Back to it. The best bagels in New York City are in Fairfield County, Connecticut. This is true, somehow. Pop-Up Bagels, a bagel shop that started during the pandemic when a guy was messing around with sourdough recipes and then decided to try his hand at bagels, has won Brooklyn Bagel Fest's best bagel two years running. I have them just about every Sunday. They're great. The fastest growing bagel shop anyone has ever seen has raised millions of dollars from people like Paul Rudd, Michael Strahan, and Michael Phelps. The guy who runs it, Adam Goldberg, at least as of fairly recently, which is the last I heard, still works a full time job selling flood mitigation systems. So if you're scoring at home, a guy who had never made bagels before now makes the best bagels in New York City, a city world renowned for bagels, and he does it from the suburbs of Connecticut. A business that traditionally doesn't scale because of the thin margins, a bagel shop, is scaling aggressively. A space that everyone assumed was saturated, there's a bagel shop in every town in America, or at least the Northeast, apparently isn't. So what the heck is going on? A differentiator? I've followed Pop-Up Bagels pretty closely because I love bagels and I love unexpected stuff and I love figuring out why something is growing disproportionately fast to everything else that looks like it. Early on, I saw an interview where Goldberg was talking about why he thought there was opportunity. I'm paraphrasing, but he said something about the magic of a hot bagel, but that most bagels you get aren't hot. And that is true. When you go to every bagel shop in the country, you'll see a bunch of wire bins with bagels that have been cooked some time that day sitting in there. Every once in a while, you win the bagel lotto and you get a fresh, piping hot everything bagel with steam coming out. Most of the time, you get one that's lukewarm or cold. One of the bagel shops I used to live near in Union Square in New York City was called David's and they'd hang signs that said hot when they added a new batch of hot bagels to one of those wire bins and I always picked the type of bagel exclusively based on that. I hate pumpernickel bagels, but a fresh one out of the oven is better than a cold sesame eight days a week. Goldberg realized this. And this was his differentiator. He saw the gulf between a hot bagel and a not hot one as not a trivial thing, but as a totally new business opportunity. At Pop-Up Bagels, you would always get a piping hot bagel. Now, again, I don't know this guy. We've never talked. I don't even know if he did this on purpose, but Pop-Up Bagels is set up as if he did. The core differentiator of the thing that matters is that every bagel you ever get from Pop-Up is hot. And every other part of the business supports this differentiator. During the early days before he had permanent space, he'd borrow the kitchens of restaurants or rent kitchens to host his pop-ups. Since he needed the bagels to be hot when people picked them up, he had customers pre-order a few days before and select a pickup time so that the logistics would work. This way, he could plan out the waves of hot bagels and perfectly predict inventory. This decision, starting with hot bagels, makes all the subsequent ones easy. For example, most bagel shops let you walk in, order your bagel, have the people work in there, put sky and cream cheese on it. Then you go to the cashier, pay five bucks, and you're on your way. But this would be logistically impossible if your goal was to give everyone piping hot bagels. It'd take too much time. So Pop-Up can't do it. And since they can't do it, they can make another decision. They don't need spaces with storefronts. They just need industrial kitchen space. Then, if you're pre-ordering hot bagels already, it makes no sense to order just one bagel, especially if you can't get cream cheese on it. So it's dozens only. And two containers of quote, schmears, a selection of cream cheeses that come in little cardboard containers. This model, Pop-Up shops, bagels by the dozen, pre-order and pick up at a set time so your bagels are always fresh out of the oven, worked. Word spread. During the early days, Pop-Up got so busy that you had to book your bagel slot a week early. This led to a subscription offering where you could subscribe and have a standing appointment for your dozen hot bagels, say, every Saturday at 10 a.m. From a pricing perspective, if you have a real differentiator, you should be able to overcharge for it. And Pop-Up Bagels does. They charge 42 bucks for a dozen bagels and two schmears. For reference, the average cost of a dozen bagels in New York City is about 15 bucks. The margin comes from the value and the lack of competition. Sure, there are other bagel shops, but not places that guarantee hot bagels and let you grab and go. No payment, no waiting on people getting bacon, egg and cheeses in front of you, on and on. The willingness to overpay shows the value over the alternative. Finally, from a bagel quality perspective, people overpaying give some financial wiggle room. The New York Times describes Pop-Up Bagels' product as smaller, airier and crispier than a traditional New York bagel, with a texture similar to a baguette. Goldberg said the dough is double-proofed, which adds flavor and creates a softer interior and more robust crust. When I asked my friend, a bread baker, what the heck double-proofed meant, he basically said it's a better way to make bread and it's not really a secret. It just takes more time and effort. And bagels are cheap, so people crank them out quicker and tend to not do that. It's a volume business, not quality. So the waterfall happens. Since hot bagels are something people will pay extra for, Pop-Up can spend more money and time on each bagel and make them higher quality. So they win awards. And the whole thing reinforces itself. As Pop-Up has grown, Goldberg has stuck to the formula. There are now six kitchens that you can schedule pickup orders from. The location I go to appears to be run by a bunch of high school kids. You pull up in your car at the required time, they walk to the window and ask you for your bagel, and then come back a minute later with your bag of piping hot bagels. You drive home and you eat. For parents, the overwhelming demographic ordering bagels each weekend in Fairfield County and the other pickup location, the Hamptons, this is an extraordinary experience. Not having to get out of the car, having a bunch of hot delicious food kids are going to eat, having a routine, these are all things parents value. And the locations are filled with pretty affluent folks able to pay $42 for bagels. The differentiator matches with the customer need, the customer's process, and it's sticky. Goldberg realized that hot bagels matter a whole lot and basically nothing else from a traditional bagel shop matters at all, at least for his customer. So when you break it down, it's not actually all that surprising that the best bagels in New York City come from the suburbs of Connecticut. They're playing a fundamentally different game than anyone else. One that's much easier to win. A differentiator generator. I have no idea if pop-up bagels is going to work at scale, but no startup can ever guarantee their differentiator is going to work forever. The goal is to get escape velocity, to get enough momentum to move into the next stage of the business, to build a little cult of early customers in the good way, not the creepy way, then decide on a new strategy if growth requires it. But the differentiator gives you options, gives you speed. Now for your differentiator, how do you come up with one? More realistically, how do you decide which of the things you're doing is worth being the focal point of your business? I've got a list of five things that'll hopefully jar something loose for you. First, your differentiator needs to be aggressively, diametrically opposed to the competition. The best way to do this is to start with a tight customer segment and realize why their needs aren't being met and start from first principles to figure out a way that meets them exactly where they are. This does two things. First, it lets you do that competitor jujitsu move where you use their strengths against them. It might be easy to say, well, hey, the local bagel shops can get apps that allow people to pre-order. And sure, they could, but they could never go all in on this strategy because of all the legacy and sunk costs they have. They've got locations with stations for bacon, egg, and cheese and a method for getting bagels out. They have cashiers, they have staff. If Pop-Up Bagels does 10 things that support the big differentiator of pre-ordering and picking up hot bagels, maybe existing bagel shops could do each of those 10 things at 40 to 50% as well as Pop-Up. Add that up and you get a terrible product. Being aggressively different from competition creates a moat. Second, being different creates word of mouth. And when something is meaningfully different, it's eminently shareable. First of all, what people share is going to be consistent. Before I tried Pop-Up Bagels, I had four or five friends tell me basically the same thing. Quote, you pre-order your bagels and pick them up so they're right out of the oven when you get there. It's amazing. Everyone said the bagels were great, but they said they were great because they were hot. Real differentiators travel. My grandfather and father both have a saying they repeat like their parents. To be a difference, a difference has to make a difference. The thing that separates you from however your customer solves their problem now needs to be seriously different. A good sign here for you is lots of people being highly skeptical of your differentiator. Ideally, you'd like 95% of people you meet to say what you're doing is a terrible idea and 5% to want to run through traffic to get it. It's a bad sign if everyone is in agreement that your differentiator is a good idea. That means it's too safe. Push farther away from the competition. It should make people feel a bit uncomfortable. Ideally, one of your friends is going to pull you aside and say something like, hey, don't risk too much on this or, hey, I'm saying this as a friend. This isn't a good idea. All the obvious ideas are already taken. That type of reaction is a good sign. Most great differentiators remove or ignore 95% of what competitors do and pick 5% and focus on it for a specific customer. That is where the value is. No one is ever going to pay 40 bucks for a dozen bagels until they do. Second, people will overpay for your differentiator. I happily overpay for hot bagels. I overpay for shirts made for tall lanky guys. I overpay for stuff that solves a specific problem for me and is significantly better than all of my other options. A great test for a viable differentiator is to charge a huge margin for it. Do it early. Do it with tests. Do what you've got. Third, most differentiators come after some sort of shift. There's a question founders get a lot. Why now? What's happened that makes this opportunity viable today when it wasn't a year or two ago? For pop-up bagels, the pandemic changed people's behavior around ordering and picking up food. In general, we've seen the rise of ghost kitchens or working kitchens that didn't have a traditional storefront or seating atmosphere. Also, apps for ordering and reserving time slots are now white labelable and cheap. You don't need a developer to build you one. You just need 50 bucks a month and a Stripe plugin and you're off and running. Tech barriers, cooking barriers, and mental barriers all broke down leading up to the rise of pop-up. What is this for you? Fourth, great differentiators smush stuff together. If you step back, pop-up bagels looks a little bit more like a SaaS business than a bagel shop. Monthly subscribers, predictable demand, one product delivered to many without customization. Bringing a SaaS subscription simplified product approach to bagels was brilliant. This smushing generally comes from the founder's experience. What's the secret you know about your customer mixed with something you learned from another industry? And finally, the hardest part of any differentiator, sticking to it. What blows me away about pop-up bagels isn't that it got started during the pandemic by a guy that had never cooked bagels before or that it gained this amount of traction. By the way, Goldberg is 47, so all you 32 year olds saying you're too old to start something or learn something new, come on. What really blows me away is that the guy who started it has been so disciplined. Can you imagine how many people have said something like, oh, you have to open up a sit down restaurant and oh, you want margin, you got to serve mimosas or you got to freeze these things and get them into Whole Foods. And some of the people suggesting those things might have been like Michael Phelps and Paul Rudd. How many people told him early on that this was a fad, that people wouldn't continue to get his bagels and what he was doing was nuts? One of the hardest parts of a differentiator is sticking with it. Humans love sabotaging themselves as soon as something good starts to happen. Apparently we've been doing it since 27 AD when Patronius, a stoic, I think, said this quote which I found on a random article. I was to learn later in life that we tend to meet any new situation by reorganizing and what a wonderful method it can be for creating the illusion of progress while producing confusion, inefficiency, and demoralization. Founders take time to show themselves, give them that time. Then once you have them, you want to lean into them for a while without changing course and reorganizing constantly. So many founders have a brand new differentiator every week, you don't give them a chance to develop. And differentiators are hard to predict. Like most things in the startup world, the magic happens after you get in with customers and thrash around a bit, not before. Thrash, test, then lean in. That is the plan. We'll end with one of many quotes from Interstellar I didn't quite understand but I'll pretend I did because it sounded deep. Quote, we used to look up at the sky and wonder our place in the stars. Now we just look down and worry about our place in the dirt. Indeed, McConaughey. Indeed. This was the Idea to Startup podcast brought to you by Tacklebox. If you have a startup idea and a full-time job, head to gettacklebox.com and apply. We'll get back to you in 72 hours. Have a great week!"}, "podcast_summary": "In this podcast episode, the host discusses the importance of finding a strong differentiator for your business. The differentiator is what sets your business apart from others and helps you make decisions quickly. The host uses the example of a bagel shop called Pop-Up Bagels in Connecticut that has become known for making the best bagels in New York City. The differentiator for this shop is that they always serve hot bagels, while most other bagel shops serve lukewarm or cold ones. The host breaks down the differentiators and provides a framework for finding your own. They include being aggressively different from the competition, having a differentiator that people are willing to pay more for, taking advantage of shifts or changes in the market, combining different ideas or industries together, and sticking with your differentiator even when faced with doubts or pressure to change.", "podcast_guest": "Adam Goldberg", "podcast_highlights": ""}